load-test.yml
config:
  target: 'https://your-vercel-app.vercel.app'  # 실제 Vercel URL로 변경하세요
  phases:
    # 1단계: 워밍업 (30초간 10명씩 증가)
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    
    # 2단계: 점진적 증가 (60초간 50명까지)
    - duration: 60
      arrivalRate: 50
      name: "Ramp up to 50 users"
    
    # 3단계: 목표 부하 (120초간 150명 유지)
    - duration: 120
      arrivalRate: 150
      name: "Sustained load - 150 users"
    
    # 4단계: 스파이크 테스트 (30초간 300명)
    - duration: 30
      arrivalRate: 300
      name: "Spike test - 300 users"
    
    # 5단계: 쿨다운 (30초간 감소)
    - duration: 30
      arrivalRate: 10
      name: "Cool down"

  defaults:
    headers:
      User-Agent: "Artillery Load Test"

scenarios:
  - name: "Main user flow"
    weight: 70
    flow:
      # 메인 페이지 접속
      - get:
          url: "/"
          capture:
            - header: "x-vercel-cache"
              as: "cacheStatus"
      
      # 사용자 생각 시간 (1-3초)
      - think: "{{ $randomInt(1, 3) }}"
      
      # order.json 로드 (앱 시작 시 필요)
      - get:
          url: "/contents/order.json"
          expect:
            - statusCode: 200
            - contentType: json
      
      # 사용자 생각 시간
      - think: "{{ $randomInt(2, 4) }}"
      
      # 랜덤 이미지 로드 시뮬레이션 (0-8.png)
      - get:
          url: "/contents/{{ $randomInt(0, 8) }}.png"
          expect:
            - statusCode: 200
      
      # 사용자 상호작용 시간
      - think: "{{ $randomInt(3, 7) }}"
      
      # 비디오 파일 로드 시뮬레이션
      - get:
          url: "/contents/fap/팹1.webm"
          expect:
            - statusCode: 200
      
      # 더 긴 사용자 생각 시간
      - think: "{{ $randomInt(5, 10) }}"

  - name: "Quick browsing"
    weight: 20
    flow:
      # 빠른 브라우징 패턴
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/contents/order.json"
      - think: 2
      - get:
          url: "/contents/{{ $randomInt(0, 8) }}.png"

  - name: "Heavy media user"
    weight: 10
    flow:
      # 미디어를 많이 로드하는 사용자
      - get:
          url: "/"
      - get:
          url: "/contents/order.json"
      - loop:
          - get:
              url: "/contents/{{ $randomInt(0, 8) }}.png"
          - think: 1
        count: 5
      - get:
          url: "/contents/QC/QC1.webm"
      - think: 3
      - get:
          url: "/contents/promote/홍보실1.webm"

# 성능 임계값 설정
ensure:
  p95: 3000  # 95%의 요청이 3초 이내
  p99: 5000  # 99%의 요청이 5초 이내
  maxErrorRate: 5  # 에러율 5% 이하